clone_shop_app/app/views/home/mypage.html.erb

SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
              <h5 class="card-title">주문/배송조회</h5>
              <p class="card-text">총 <%= @user.orders.count %>건의 주문 내역이 있습니다.</p>