clone_shop_app/app/admin/packs.rb

  scope -> { "비공개" }, :unpublished

  index do
    selectable_column

    id_column

    column :image do |pack|
      if pack.image.attached?
        image_tag url_for(pack.image), class: "small_img"
      else
        "이미지 없음"
      end
    end
    column :product_name
    column :company_name
    column :price do |pack|
      number_to_currency(pack.price)
    end
    column :is_publish

    actions
  end

  batch_action :publish do |ids|
    @packs = Pack.where(id: ids)

    @packs.each do |pack|
      pack.update(is_publish: true)
---
SELECT "packs".* FROM "packs" WHERE "packs"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "packs" SET "is_publish" = ?, "updated_at" = ? WHERE "packs"."id" = ?  [["is_publish", 1], ["updated_at", "2021-10-08 05:15:14.829039"], ["id", 1]]

  batch_action :unpublish do |ids|
    @packs = Pack.where(id: ids)

    @packs.each do |pack|
      pack.update(is_publish: false)
---
SELECT "packs".* FROM "packs" WHERE "packs"."id" IN (?, ?, ?)  [["id", 20], ["id", 19], ["id", 18]]
UPDATE "packs" SET "is_publish" = ?, "updated_at" = ? WHERE "packs"."id" = ?  [["is_publish", 0], ["updated_at", "2021-10-08 05:12:15.823639"], ["id", 18]]