clone_shop_app/app/admin/users.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]
---

    column :email
    column "장바구니 유무" do |user|
      user.carts.present?