clone_shop_app/app/views/orders/show.html.erb

			<h3>주문 정보 확인</h3>
			<% @order.order_items.each do |item| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 3]]