clone_shop_app/app/models/cart.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."pack_id" = ? LIMIT ?  [["user_id", 1], ["pack_id", 2], ["LIMIT", 1]]
---
  def verified_save

    # cart = self
    sample_carts = user.carts
    # current_user = cart.user #=>  User.find(cart.user_id)

    present_cart = sample_carts.find_by(pack_id: pack_id)