clone_shop_app/app/controllers/carts_controller.rb

  def index
    @carts = current_user.carts


    @product_price = 0
    @carts.each do |cart|
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]

  def create
    cart = Cart.new(
      pack_id: params[:pack_id],
      user: current_user,
      quantity: params[:quantity],
    )
    sample_carts = current_user.carts

    #기존에 내가 같은 제품 등록했는지 찾기
    remain_cart = sample_carts.find_by(pack_id: cart.pack_id)

    if remain_cart.present?
      sum_quantity = remain_cart.quantity + cart.quantity.to_i

      remain_cart.update(quantity: sum_quantity)
    else
      cart.save
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."pack_id" = ? LIMIT ?  [["user_id", 1], ["pack_id", 2], ["LIMIT", 1]]
UPDATE "carts" SET "quantity" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 2], ["updated_at", "2021-10-11 05:38:38.080507"], ["id", 5]]
INSERT INTO "carts" ("user_id", "pack_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["pack_id", 2], ["quantity", 4], ["created_at", "2021-10-11 06:11:34.490194"], ["updated_at", "2021-10-11 06:11:34.490194"]]

  def destroy
    cart = Cart.find(params[:id])

    cart.destroy
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]