clone_shop_app/app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 4]]
---
  def destroy
    cart = Cart.find(params[:id])

    cart.destroy