clone_shop_app/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
  def index
    @orders = current_user.orders

INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2021-10-13 06:34:20.447128"], ["updated_at", "2021-10-13 06:34:20.447128"]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" IN (?, ?, ?, ?)  [["id", 3], ["id", 5], ["id", 8], ["id", 9]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ?  [["id", 17]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 10]]
INSERT INTO "order_items" ("order_id", "pack_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_id", 26], ["pack_id", 1], ["quantity", 3], ["created_at", "2021-10-14 08:45:33.046598"], ["updated_at", "2021-10-14 08:45:33.046598"]]
SELECT  "packs".* FROM "packs" WHERE "packs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 17]]
---
  def create
    order = Order.create(user_id: current_user.id)

    carts = Cart.where(id: params[:cart_id])

    carts.each do |cart|
      order.order_items.create(pack_id: cart.pack.id, quantity: cart.quantity)
    end

    carts.destroy_all

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])