clone_shop_app/app/controllers/packs_controller.rb

  def show
    @pack = Pack.find(params[:id])
---
SELECT  "packs".* FROM "packs" WHERE "packs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]