clone_shop_app/app/controllers/payments_controller.rb

  def create
    order = Order.find(params[:order_id])

    iamport = Iamport.payment(params[:imp_uid])
    response = iamport["response"]

    if response["status"] == "paid"
      order.update(
        address: response["buyer_addr"],
        email: response["buyer_email"],
        name: response["buyer_name"],
        phone: response["buyer_tel"],
        post_code: response["buyer_postcode"]
      )
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 3], ["updated_at", "2021-10-14 08:45:46.199305"], ["id", 26]]